namespace Lesson4_变量的命名规范
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("变量的命名规范");

            #region 知识点一：必须遵守的规则
            // 1.不能重名
            // 2.不能以数字开头
            // 3.不能使用关键字（保留字）作为变量名
            // 4.不能使用特殊符号（下划线除外）作为变量名

            // 建议的命名规则：变量名要有含义，见名知意 --> 用英文（拼音）表示变量的作用
            // 不建议的命名规则：用汉字命名

            #endregion

            #region 知识点二：常用命名规则
            // 驼峰命名法——首字母小写，后面每个单词的首字母大写
            // 帕斯卡命名法——每个单词的首字母都大写（函数、类）
            
            // C# 中对大小写是敏感的 是区分的 
            #endregion
        }
    }
}
